# European Develompent Indicators - Iceland

## Research Questions

1. How has Iceland's GDP growth correlated with inflation rates over the past 20 years?

2. What is the relationship between educational attainment and unemployment in Iceland?

3. What is the gender wage gap trend in Iceland, and how does it compare with female employment rates?

## Datasets

* [namq_10_gdp](https://doi.org/10.2908/NAMQ_10_GDP) - Eurostat: Quarterly GDP

* [nama_10_co3_p3](https://doi.org/10.2908/NAMA_10_CO3_P3) - Eurostat: Annual household disposable income

* [tec00001](https://doi.org/10.2908/TEC00001) - Eurostat: Annual GDP at market prices

* [prc_hicp_midx](https://doi.org/10.2908/PRC_HICP_MIDX) - Eurostat: Monthly Harmonized CPI

* [prc_hicp_manr](https://doi.org/10.2908/PRC_HICP_MANR) - Eurostat: Monthly CPI inflation rate

* [prc_hicp_inw](https://doi.org/10.2908/PRC_HICP_INW) - Eurostat: Annual CPI inflation rate by income group

* [lfsa_urgaed](https://doi.org/10.2908/LFSA_URGAED) - Eurostat: Annual unemployment rate by education level

* [lfsa_egaed](https://doi.org/10.2908/LFSA_EGAED) - Eurostat: Annual employment rate by education level

* [lfsa_egised](https://doi.org/10.2908/LFSA_EGISED) - Eurostat: Annual employed persons by occupation and educational attainment level

* [lfsa_egan](https://doi.org/10.2908/LFSA_EGAN) - Eurostat: Annual employment

* [lfsi_emp_q](https://doi.org/10.2908/LFSI_EMP_Q) - Eurostat: Quarterly employment and activity by sex and age

* [lfsi_long_q](https://doi.org/10.2908/LFSI_LONG_Q) - Eurostat: Quarterly labour market transitions

* [lfsq_ergan](https://doi.org/10.2908/LFSQ_ERGAN) - Eurostat: Quarterly employment rates by citizenship

* [une_rt_m](https://doi.org/10.2908/UNE_RT_M) - Eurostat: Monthly total unemployment rate

* [edat_lfse_03](https://doi.org/10.2908/EDAT_LFSE_03) - Eurostat: Annual population by educational attainment level

* [earn_nt_net](https://doi.org/10.2908/EARN_NT_NET) - Eurostat: Annual net earnings

* [earn_gr_gpgr2](https://doi.org/10.2908/EARN_GR_GPGR2) - Eurostat: Annual gender pay gap in unadjusted form

## Imports

In [1]:
import os
import eurostat
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from IPython.display import display

from src.frame_class import Frame, Frequency, Category

## Parameters

In [2]:
COUNTRY = {
    "name": "Iceland",
    "code": "IS"
}
DATAFRAMES = [
    Frame(
        name="Quarterly GDP",
        file_name="quarterly_gdp.csv",
        description="Gross domestic product (GDP) and main components (output, expenditure and income)",
        eurostat_code="namq_10_gdp",
        frequency=Frequency.QUARTERLY,
        useful_column_filter = {
            "na_item": ["B1GQ"],
            "unit": ["CLV_PCH_SM", "CLV_PCH_PRE"],  # fallback included
            "s_adj": ["SCA", "SA", "NSA"]          # preference order
        },
        categories=[Category.MACROECONOMICS]
    ),
    Frame(
        name="Annual Household Disposable Income",
        file_name="annual_household_disposable_income.csv",
        description="Household final consumption expenditure by purpose (COICOP 1999)",
        eurostat_code="nama_10_co3_p3",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "coicop": ["TOTAL"],
            "unit": ["CP_EUR_HAB"]
        },
        categories=[Category.MACROECONOMICS]
    ),
    Frame(
        name="Annual GDP at Market Prices",
        file_name="annual_gdp_at_market_prices.csv",
        description="Gross domestic product at market prices",
        eurostat_code="tec00001",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "na_item": ["B1GQ"],
            "unit": ["CP_EUR_HAB"]
        },
        categories=[Category.MACROECONOMICS]
    ),
    Frame(
        name="Monthly Harmonized CPI",
        file_name="monthly_harmonized_cpi.csv",
        description="HICP - monthly data (index)",
        eurostat_code="prc_hicp_midx",
        frequency=Frequency.MONTHLY,
        useful_column_filter = {
            "unit": ["I15"],
            "coicop": ["TOT_X_NRG_FOOD", "TOT_X_ALC_TBC"]
        },
        categories=[Category.PRICES_AND_INFLATION]
    ),
    Frame(
        name="Monthly CPI Inflation Rate",
        file_name="monthly_cpi_inflation_rate.csv",
        description="HICP - monthly data (annual rate of change)",
        eurostat_code="prc_hicp_manr",
        frequency=Frequency.MONTHLY,
        useful_column_filter = {
            "unit": ["RCH_A"],
            "coicop": ["TOT_X_NRG_FOOD", "TOT_X_TBC"]  # core + headline
        },
        categories=[Category.PRICES_AND_INFLATION]
    ),
    Frame(
        name="Annual CPI Inflation Rate by Income Group",
        file_name="annual_cpi_inflation_rate_by_income_group.csv",
        description="HICP - item weights",
        eurostat_code="prc_hicp_inw",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["rate"],
            "coicop": ["TOT_X_NRG_FOOD", "TOT_X_TBC"]
        },
        categories=[Category.PRICES_AND_INFLATION]
    ),
    Frame(
        name="Annual Unemployment Rate by Education Level",
        file_name="annual_unemployment_rate_by_education_level.csv",
        description="Unemployment rates by educational attainment level",
        eurostat_code="lfsa_urgaed",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["PC"],
            "sex": ["T"],
            "age": ["Y25-64"],
            "isced11": ["ED0-2", "ED3_4", "ED5-8"]  # low, medium, high education
        },
        categories=[Category.LABOR_MARKET, Category.EDUCATION_AND_HUMAN_CAPITAL]
    ),
    Frame(
        name="Annual Employment Rate by Education Level",
        file_name="annual_employment_rate_by_education_level.csv",
        description="Employed persons by educational attainment level",
        eurostat_code="lfsa_egaed",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["THS_PER"],  # persons employed
            "sex": ["T"],
            "age": ["Y25-64"],
            "isced11": ["TOTAL", "ED0-2", "ED3_4", "ED5-8"]
        },
        categories=[Category.LABOR_MARKET, Category.EDUCATION_AND_HUMAN_CAPITAL]
    ),
    Frame(
        name="Annual Employed Persons by Occupation and Educational Attainment Level",
        file_name="annual_employed_persons_by_occupation_and_educational_attainment_level.csv",
        description="Employed persons by occupation and educational attainment level",
        eurostat_code="lfsa_egised",
        frequency=Frequency.ANNUAL,
        categories=[Category.LABOR_MARKET, Category.EDUCATION_AND_HUMAN_CAPITAL]
    ),
    Frame(
        name="Annual Employment",
        file_name="annual_employment.csv",
        description="Employed persons by citizenship",
        eurostat_code="lfsa_egan",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["THS_PER"],
            "sex": ["T"],
            "age": ["Y25-64"],
            "citizen": ["TOTAL"]
        },
        categories=[Category.LABOR_MARKET]
    ),
    Frame(
        name="Quarterly employment and activity by sex and age",
        file_name="quarterly_employment_and_activity_by_sex_and_age.csv",
        description="Employment and activity by sex and age - quarterly data",
        eurostat_code="lfsi_emp_q",
        frequency=Frequency.QUARTERLY,
        categories=[Category.LABOR_MARKET]
    ),
    Frame(
        name="Quarterly labour market transitions",
        file_name="quarterly_labour_market_transitions.csv",
        description="Labour market transitions - quarterly data",
        eurostat_code="lfsi_long_q",
        frequency=Frequency.QUARTERLY,
        categories=[Category.LABOR_MARKET]
    ),
    Frame(
        name="Quarterly employment rates by citizenship",
        file_name="quarterly_employment_rates_by_citizenship.csv",
        description="Employment rates by citizenship - quarterly data",
        eurostat_code="lfsq_ergan",
        frequency=Frequency.QUARTERLY,
        categories=[Category.LABOR_MARKET]
    ),
    Frame(
        name="Monthly total unemployment rate",
        file_name="monthly_total_unemployment_rate.csv",
        description="Unemployment by sex and age - monthly data",
        eurostat_code="une_rt_m",
        frequency=Frequency.MONTHLY,
        useful_column_filter = {
            "s_adj": ["SA"],
            "age": ["TOTAL"],
            "sex": ["T"],
            "unit": ["PC_ACT"]
        },
        categories=[Category.LABOR_MARKET]
    ),
    Frame(
        name="Annual population by educational attainment level",
        file_name="annual_population_by_educational_attainment_level.csv",
        description="Population in private households by educational attainment level - main indicators",
        eurostat_code="edat_lfse_03",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "sex": ["T"],
            "age": ["Y25-64"],
            "unit": ["PC"],
            "isced11": ["ED0-2", "ED3_4", "ED5-8"]
        },
        categories=[Category.EDUCATION_AND_HUMAN_CAPITAL]
    ),
    Frame(
        name="Annual net earnings",
        file_name="annual_net_earnings.csv",
        description="Annual net earnings",
        eurostat_code="earn_nt_net",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["EUR"],
            "estruct": ["NET"],
            "ecase": ["P1_NCH_AW100"]  # single, average wage, no children
        },
        categories=[Category.EARNINGS_AND_INEQUALITY]
    ),
    Frame(
        name="Annual gender pay gap in unadjusted form",
        file_name="annual_gender_pay_gap_in_unadjusted_form.csv",
        description="Gender pay gap in unadjusted form by NACE Rev. 2 activity - structure of earnings survey methodology",
        eurostat_code="earn_gr_gpgr2",
        frequency=Frequency.ANNUAL,
        useful_column_filter = {
            "unit": ["PC"],
            "nace_r2": ["B-S"]  # whole economy
        },
        categories=[Category.EARNINGS_AND_INEQUALITY]
    )
]

DATA_PATH = "data/"

print(f"Frame count: {len(DATAFRAMES)}")

Frame count: 17

In [3]:
for frame in DATAFRAMES:
    df: pd.DataFrame | None = None

    if os.path.exists(os.path.join("original_data", frame.file_name)):
        df = pd.read_csv(os.path.join("original_data", frame.file_name))
        print(f"Loaded {frame.name} dataset from local CSV.")

    else:
        try:
            df = eurostat.get_data_df(frame.eurostat_code, flags=False)
            os.makedirs("original_data", exist_ok=True)
            df.to_csv(os.path.join("original_data", frame.file_name), index=False)

            print(f"Downloaded and saved {frame.name} dataset.")

        except Exception as e:
            print(f"Failed to download {frame.name}: {e}")

    df.rename(columns={"geo\\TIME_PERIOD": "geo"}, inplace=True)
    df = df[df["geo"] == COUNTRY["code"]]
    df = df.dropna(axis=1, how='all')

    if "currency" in df.columns:
        df.rename(columns={"currency": "unit"}, inplace=True)

    if "freq" in df.columns:
        df = df.drop(columns=["freq"])

    if "unit" not in df.columns:
        df.insert(0, "unit", "rate")

    if frame.useful_column_filter:
        for col, valid_values in frame.useful_column_filter.items():
            if col in df.columns:
                df = df[df[col].isin(valid_values)]

    frame.dataframe = df

    os.makedirs(DATA_PATH, exist_ok=True)
    frame.dataframe.to_csv(os.path.join(DATA_PATH, frame.file_name), index=False)

Loaded Quarterly GDP dataset from local CSV.
Loaded Annual Household Disposable Income dataset from local CSV.
Loaded Annual GDP at Market Prices dataset from local CSV.
Loaded Monthly Harmonized CPI dataset from local CSV.
Loaded Monthly CPI Inflation Rate dataset from local CSV.
Loaded Annual CPI Inflation Rate by Income Group dataset from local CSV.
Loaded Annual Unemployment Rate by Education Level dataset from local CSV.
Loaded Annual Employment Rate by Education Level dataset from local CSV.
Loaded Annual Employed Persons by Occupation and Educational Attainment Level dataset from local CSV.
Loaded Annual Employment dataset from local CSV.
Loaded Quarterly employment and activity by sex and age dataset from local CSV.
Loaded Quarterly labour market transitions dataset from local CSV.
Loaded Quarterly employment rates by citizenship dataset from local CSV.
Loaded Monthly total unemployment rate dataset from local CSV.
Loaded Annual population by educational attainment level dataset from local CSV.
Loaded Annual net earnings dataset from local CSV.
Loaded Annual gender pay gap in unadjusted form dataset from local CSV.

In [4]:
for frame in DATAFRAMES:
    column_names = frame.dataframe.columns.tolist()
    time_period_index = column_names.index("geo")
    data_columns = column_names[time_period_index + 1 :]

    if frame.frequency == Frequency.MONTHLY:
        frame.dataframe.rename(columns={col: f"{col[:4]}-{col[5:7]}-01T00:00:00" for col in data_columns}, inplace=True)
    elif frame.frequency == Frequency.QUARTERLY:
        frame.dataframe.rename(columns={col: f"{col[:4]}-{(int(col[6]) - 1) * 3 + 1:02d}-01T00:00:00" for col in data_columns}, inplace=True)
    elif frame.frequency == Frequency.ANNUAL:
        frame.dataframe.rename(columns={col: f"{col}-01-01T00:00:00" for col in data_columns}, inplace=True)

    display(frame.dataframe.head(10))

,unit,s_adj,na_item,geo,1995-01-01T00:00:00,1995-04-01T00:00:00,1995-07-01T00:00:00,1995-10-01T00:00:00,1996-01-01T00:00:00,1996-04-01T00:00:00,...,2023-01-01T00:00:00,2023-04-01T00:00:00,2023-07-01T00:00:00,2023-10-01T00:00:00,2024-01-01T00:00:00,2024-04-01T00:00:00,2024-07-01T00:00:00,2024-10-01T00:00:00,2025-01-01T00:00:00,2025-04-01T00:00:00
25695,CLV_PCH_PRE,SCA,B1GQ,IS,NaN,2.0,0.9,-0.7,3.5,0.2,...,0.0,2.5,-3.4,0.6,-1.0,2.0,-0.7,-2.2,2.9,-0.7
26776,CLV_PCH_SM,NSA,B1GQ,IS,NaN,NaN,NaN,NaN,8.4,4.3,...,10.2,8.1,3.7,-0.4,-2.2,0.2,-0.7,-1.2,2.7,-1.9
27814,CLV_PCH_SM,SCA,B1GQ,IS,NaN,NaN,NaN,NaN,5.9,4.0,...,9.5,8.8,3.3,-0.4,-1.3,-1.8,1.0,-1.8,2.1,-0.7

,unit,coicop,geo,1995-01-01T00:00:00,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,1999-01-01T00:00:00,2000-01-01T00:00:00,2001-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
29372,CP_EUR_HAB,TOTAL,IS,11030.0,11820.0,13200.0,14740.0,16670.0,19160.0,16650.0,...,24760.0,29790.0,34440.0,33970.0,32480.0,26690.0,30950.0,37820.0,39250.0,40210.0

,na_item,unit,geo,2013-01-01T00:00:00,2014-01-01T00:00:00,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
20,B1GQ,CP_EUR_HAB,IS,38460.0,42350.0,49180.0,57900.0,65850.0,65330.0,63430.0,54190.0,61360.0,74950.0,77210.0,79480.0

,unit,coicop,geo,1996-01-01T00:00:00,1996-02-01T00:00:00,1996-03-01T00:00:00,1996-04-01T00:00:00,1996-05-01T00:00:00,1996-06-01T00:00:00,1996-07-01T00:00:00,...,2024-12-01T00:00:00,2025-01-01T00:00:00,2025-02-01T00:00:00,2025-03-01T00:00:00,2025-04-01T00:00:00,2025-05-01T00:00:00,2025-06-01T00:00:00,2025-07-01T00:00:00,2025-08-01T00:00:00,2025-09-01T00:00:00
24535,I15,TOT_X_ALC_TBC,IS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,127.91,127.70,129.05,129.66,130.65,131.28,133.75,134.42,134.18,133.64
24926,I15,TOT_X_NRG_FOOD,IS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,123.37,122.41,123.73,124.35,125.43,126.14,129.16,129.94,129.69,128.97

,unit,coicop,geo,1997-01-01T00:00:00,1997-02-01T00:00:00,1997-03-01T00:00:00,1997-04-01T00:00:00,1997-05-01T00:00:00,1997-06-01T00:00:00,1997-07-01T00:00:00,...,2024-12-01T00:00:00,2025-01-01T00:00:00,2025-02-01T00:00:00,2025-03-01T00:00:00,2025-04-01T00:00:00,2025-05-01T00:00:00,2025-06-01T00:00:00,2025-07-01T00:00:00,2025-08-01T00:00:00,2025-09-01T00:00:00
17565,RCH_A,TOT_X_NRG_FOOD,IS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.7,3.6,3.0,2.9,3.5,3.0,3.6,3.4,3.4,4.0
17697,RCH_A,TOT_X_TBC,IS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.6,3.7,3.3,3.3,3.8,3.4,3.8,3.6,3.6,4.2

,unit,coicop,geo,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,1999-01-01T00:00:00,2000-01-01T00:00:00,2001-01-01T00:00:00,2002-01-01T00:00:00,...,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00,2025-01-01T00:00:00
20065,rate,TOT_X_NRG_FOOD,IS,NaN,NaN,NaN,NaN,681.40,686.66,694.47,...,748.95,744.83,784.66,789.15,798.43,750.76,713.66,732.76,743.97,739.1
20197,rate,TOT_X_TBC,IS,NaN,NaN,NaN,NaN,980.97,980.93,979.90,...,988.32,987.56,991.70,992.83,994.23,993.07,987.94,991.05,992.26,992.1

,unit,sex,age,isced11,geo,1995-01-01T00:00:00,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,1999-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
17818,PC,T,Y25-64,ED0-2,IS,NaN,NaN,NaN,NaN,2.3,...,4.0,2.7,2.1,2.7,3.2,6.3,6.8,5.3,4.0,4.1
17926,PC,T,Y25-64,ED3_4,IS,NaN,NaN,NaN,NaN,NaN,...,3.1,3.0,2.0,2.0,3.0,5.7,6.0,2.9,2.5,2.2
17964,PC,T,Y25-64,ED5-8,IS,NaN,NaN,NaN,NaN,NaN,...,2.8,1.7,1.6,1.9,2.2,3.8,4.0,2.4,2.4,2.3

,unit,sex,age,isced11,geo,1995-01-01T00:00:00,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,1999-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
17627,THS_PER,T,Y25-64,ED0-2,IS,NaN,NaN,NaN,NaN,49.7,...,32.9,29.3,30.6,30.7,30.6,30.2,24.2,27.0,28.0,27.9
17735,THS_PER,T,Y25-64,ED3_4,IS,NaN,NaN,NaN,NaN,41.8,...,52.4,56.1,54.0,53.9,54.1,54.3,61.9,64.6,67.1,65.8
17773,THS_PER,T,Y25-64,ED5-8,IS,NaN,NaN,NaN,NaN,27.3,...,59.1,63.8,68.5,73.0,77.2,73.7,73.0,77.7,81.8,89.0
17837,THS_PER,T,Y25-64,TOTAL,IS,110.9,112.1,111.0,113.6,119.0,...,144.5,149.2,153.1,157.6,161.9,158.2,159.0,169.3,176.8,183.7

,age,sex,isco08,isced11,unit,geo,1995-01-01T00:00:00,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
16,Y20-64,F,NRP,ED0-2,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
42,Y20-64,F,NRP,ED34_44,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
60,Y20-64,F,NRP,ED35_45,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
83,Y20-64,F,NRP,ED3_4,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
114,Y20-64,F,NRP,ED5-8,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
142,Y20-64,F,NRP,NRP,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
168,Y20-64,F,NRP,TOTAL,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
415,Y20-64,F,OC1,ED0-2,THS_PER,IS,NaN,NaN,NaN,NaN,...,0.6,0.6,0.5,0.5,0.7,0.8,0.6,0.7,0.9,0.8
453,Y20-64,F,OC1,ED34_44,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.8,0.8,1.0,1.3
487,Y20-64,F,OC1,ED35_45,THS_PER,IS,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.8,0.9,1.1,1.0

,unit,sex,age,citizen,geo,1995-01-01T00:00:00,1996-01-01T00:00:00,1997-01-01T00:00:00,1998-01-01T00:00:00,1999-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
19972,THS_PER,T,Y25-64,TOTAL,IS,110.9,112.1,111.0,113.6,119.0,...,144.5,149.2,153.1,157.6,161.9,158.2,159.0,169.3,176.8,183.7

,indic_em,s_adj,sex,age,unit,geo,2009-01-01T00:00:00,2009-04-01T00:00:00,2009-07-01T00:00:00,2009-10-01T00:00:00,...,2023-01-01T00:00:00,2023-04-01T00:00:00,2023-07-01T00:00:00,2023-10-01T00:00:00,2024-01-01T00:00:00,2024-04-01T00:00:00,2024-07-01T00:00:00,2024-10-01T00:00:00,2025-01-01T00:00:00,2025-04-01T00:00:00
19,ACT,NSA,F,Y15-24,PC_POP,IS,68.1,81.4,79.5,73.0,...,76.0,81.8,86.4,82.5,82.2,87.9,86.5,76.7,83.1,92.2
56,ACT,NSA,F,Y15-24,THS_PER,IS,13.0,16.0,15.0,14.0,...,15.0,17.0,18.0,17.0,17.0,18.0,18.0,17.0,18.0,20.0
93,ACT,NSA,F,Y15-29,PC_POP,IS,70.4,80.3,77.9,71.6,...,78.8,84.3,83.4,78.7,81.4,90.0,88.3,79.8,81.9,92.4
130,ACT,NSA,F,Y15-29,THS_PER,IS,22.0,25.0,24.0,22.0,...,27.0,29.0,28.0,27.0,28.0,31.0,31.0,29.0,29.0,33.0
167,ACT,NSA,F,Y15-64,PC_POP,IS,79.5,81.6,82.5,81.4,...,82.4,85.7,84.8,82.7,84.9,86.8,86.1,82.7,85.2,87.6
204,ACT,NSA,F,Y15-64,THS_PER,IS,79.0,82.0,81.0,81.0,...,96.0,101.0,100.0,98.0,101.0,104.0,104.0,101.0,104.0,107.0
241,ACT,NSA,F,Y15-74,PC_POP,IS,74.7,76.6,77.3,77.0,...,74.9,78.0,77.5,75.7,77.0,79.6,78.5,75.0,77.5,80.1
278,ACT,NSA,F,Y15-74,THS_PER,IS,82.0,84.0,84.0,84.0,...,100.0,105.0,105.0,103.0,105.0,110.0,109.0,104.0,108.0,112.0
315,ACT,NSA,F,Y20-64,PC_POP,IS,81.4,81.7,82.3,82.3,...,82.9,86.0,84.9,83.2,85.3,87.2,86.6,84.1,85.9,87.8
352,ACT,NSA,F,Y20-64,THS_PER,IS,74.0,74.0,74.0,74.0,...,89.0,93.0,93.0,91.0,94.0,97.0,97.0,94.0,96.0,99.0

,unit,s_adj,indic_em,sex,geo,2010-04-01T00:00:00,2010-07-01T00:00:00,2010-10-01T00:00:00,2011-01-01T00:00:00,2011-04-01T00:00:00,...,2023-01-01T00:00:00,2023-04-01T00:00:00,2023-07-01T00:00:00,2023-10-01T00:00:00,2024-01-01T00:00:00,2024-04-01T00:00:00,2024-07-01T00:00:00,2024-10-01T00:00:00,2025-01-01T00:00:00,2025-04-01T00:00:00
17,PC_EMP,NSA,E_E,F,IS,93.6,92.5,92.2,94.2,96.0,...,96.0,97.8,95.3,94.2,97.0,98.2,93.2,93.5,96.7,98.4
52,PC_EMP,NSA,E_E,M,IS,95.1,90.6,91.7,92.0,95.9,...,98.1,98.6,96.6,95.7,96.8,98.3,98.3,92.1,94.9,98.4
87,PC_EMP,NSA,E_E,T,IS,94.4,91.5,92.0,93.1,95.9,...,97.1,98.2,96.0,95.0,96.9,98.2,96.0,92.7,95.7,98.4
122,PC_EMP,NSA,E_I,F,IS,4.0,6.0,6.6,4.4,2.8,...,3.3,1.9,3.3,3.9,2.6,1.6,4.3,6.0,1.7,1.6
157,PC_EMP,NSA,E_I,M,IS,3.3,7.5,5.6,5.2,2.5,...,NaN,NaN,3.2,3.3,1.9,NaN,1.2,6.0,NaN,NaN
192,PC_EMP,NSA,E_I,T,IS,3.6,6.8,6.1,4.8,2.6,...,2.1,1.4,3.3,3.6,2.2,1.3,2.6,6.0,2.4,1.4
227,PC_EMP,NSA,E_U,F,IS,2.4,NaN,NaN,1.3,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
262,PC_EMP,NSA,E_U,M,IS,NaN,NaN,2.6,2.8,1.6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
297,PC_EMP,NSA,E_U,T,IS,2.0,1.7,1.9,2.1,1.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
332,PC_EMP,NSA,I_E,F,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,unit,sex,age,citizen,geo,1998-04-01T00:00:00,1999-04-01T00:00:00,2000-04-01T00:00:00,2001-04-01T00:00:00,2002-04-01T00:00:00,...,2023-01-01T00:00:00,2023-04-01T00:00:00,2023-07-01T00:00:00,2023-10-01T00:00:00,2024-01-01T00:00:00,2024-04-01T00:00:00,2024-07-01T00:00:00,2024-10-01T00:00:00,2025-01-01T00:00:00,2025-04-01T00:00:00
19,PC,F,Y15-19,EU27_2020_FOR,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
56,PC,F,Y15-19,FOR,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
93,PC,F,Y15-19,NAT,IS,61.8,66.7,76.6,73.0,61.7,...,67.9,73.3,80.5,66.4,73.3,68.3,75.0,60.3,64.0,68.3
130,PC,F,Y15-19,NEU27_2020_FOR,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
164,PC,F,Y15-19,NRP,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
224,PC,F,Y15-19,TOTAL,IS,61.4,67.3,76.9,73.4,62.5,...,67.9,73.3,76.7,66.4,72.8,69.1,73.2,60.2,64.0,68.6
262,PC,F,Y15-24,EU27_2020_FOR,IS,NaN,NaN,NaN,NaN,NaN,...,76.6,NaN,NaN,NaN,67.0,78.8,NaN,NaN,NaN,NaN
299,PC,F,Y15-24,FOR,IS,NaN,NaN,NaN,NaN,NaN,...,76.6,70.4,69.8,NaN,69.8,82.2,NaN,91.0,NaN,NaN
336,PC,F,Y15-24,NAT,IS,68.4,71.0,77.5,75.0,66.9,...,71.2,75.2,82.8,73.9,77.3,77.9,78.4,68.0,74.1,82.7
373,PC,F,Y15-24,NEU27_2020_FOR,IS,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,s_adj,age,unit,sex,geo,2003-01-01T00:00:00,2003-02-01T00:00:00,2003-03-01T00:00:00,2003-04-01T00:00:00,2003-05-01T00:00:00,...,2024-12-01T00:00:00,2025-01-01T00:00:00,2025-02-01T00:00:00,2025-03-01T00:00:00,2025-04-01T00:00:00,2025-05-01T00:00:00,2025-06-01T00:00:00,2025-07-01T00:00:00,2025-08-01T00:00:00,2025-09-01T00:00:00
759,SA,TOTAL,PC_ACT,T,IS,3.8,3.7,3.6,3.6,3.5,...,3.6,3.7,3.7,3.7,3.7,3.7,3.8,3.8,3.9,3.9

,sex,age,unit,isced11,geo,1999-01-01T00:00:00,2000-01-01T00:00:00,2001-01-01T00:00:00,2002-01-01T00:00:00,2003-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
5173,T,Y25-64,PC,ED0-2,IS,43.3,44.2,43.7,41.3,40.4,...,25.0,21.8,22.7,22.0,21.4,21.8,18.0,18.7,18.0,17.5
5249,T,Y25-64,PC,ED3_4,IS,34.9,32.0,32.6,33.1,30.8,...,36.0,37.7,34.8,34.2,33.5,34.5,39.4,38.3,37.9,36.2
5357,T,Y25-64,PC,ED5-8,IS,21.8,23.8,23.8,25.6,28.8,...,39.0,40.5,42.5,43.8,45.2,43.7,42.6,42.9,44.0,46.3

,unit,estruct,ecase,geo,2000-01-01T00:00:00,2001-01-01T00:00:00,2002-01-01T00:00:00,2003-01-01T00:00:00,2004-01-01T00:00:00,2005-01-01T00:00:00,...,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00,2024-01-01T00:00:00
1302,EUR,NET,P1_NCH_AW100,IS,27860.32,25313.39,26541.59,28076.81,29732.44,38019.05,...,37027.37,44042.96,50456.07,48794.28,47254.37,44185.83,47374.82,53001.86,54539.33,57573.09

,unit,nace_r2,geo,2007-01-01T00:00:00,2008-01-01T00:00:00,2009-01-01T00:00:00,2010-01-01T00:00:00,2011-01-01T00:00:00,2012-01-01T00:00:00,2013-01-01T00:00:00,2014-01-01T00:00:00,2015-01-01T00:00:00,2016-01-01T00:00:00,2017-01-01T00:00:00,2018-01-01T00:00:00,2019-01-01T00:00:00,2020-01-01T00:00:00,2021-01-01T00:00:00,2022-01-01T00:00:00,2023-01-01T00:00:00
85,PC,B-S,IS,23.4,20.5,18.0,17.5,17.5,17.2,18.5,16.4,17.0,15.6,15.0,13.6,13.8,11.7,9.9,8.7,9.3

In [5]:
for frame in DATAFRAMES:
    column_names = frame.dataframe.columns.tolist()
    time_period_index = column_names.index("geo")
    data_columns = column_names[time_period_index + 1 :]
    id_cols = column_names[: time_period_index + 1]

    df_melted = frame.dataframe.melt(id_vars=id_cols, value_vars=data_columns, var_name="TIME_PERIOD", value_name="value")
    df_melted = df_melted.drop(columns=["geo"])
    frame.dataframe = df_melted
    display(frame.dataframe.head(10))

    os.makedirs("melted_data", exist_ok=True)
    frame.dataframe.to_csv(os.path.join("melted_data", frame.file_name), index=False)

          unit s_adj na_item          TIME_PERIOD  value
0  CLV_PCH_PRE   SCA    B1GQ  1995-01-01T00:00:00    NaN
1   CLV_PCH_SM   NSA    B1GQ  1995-01-01T00:00:00    NaN
2   CLV_PCH_SM   SCA    B1GQ  1995-01-01T00:00:00    NaN
3  CLV_PCH_PRE   SCA    B1GQ  1995-04-01T00:00:00    2.0
4   CLV_PCH_SM   NSA    B1GQ  1995-04-01T00:00:00    NaN
5   CLV_PCH_SM   SCA    B1GQ  1995-04-01T00:00:00    NaN
6  CLV_PCH_PRE   SCA    B1GQ  1995-07-01T00:00:00    0.9
7   CLV_PCH_SM   NSA    B1GQ  1995-07-01T00:00:00    NaN
8   CLV_PCH_SM   SCA    B1GQ  1995-07-01T00:00:00    NaN
9  CLV_PCH_PRE   SCA    B1GQ  1995-10-01T00:00:00   -0.7

         unit coicop          TIME_PERIOD    value
0  CP_EUR_HAB  TOTAL  1995-01-01T00:00:00  11030.0
1  CP_EUR_HAB  TOTAL  1996-01-01T00:00:00  11820.0
2  CP_EUR_HAB  TOTAL  1997-01-01T00:00:00  13200.0
3  CP_EUR_HAB  TOTAL  1998-01-01T00:00:00  14740.0
4  CP_EUR_HAB  TOTAL  1999-01-01T00:00:00  16670.0
5  CP_EUR_HAB  TOTAL  2000-01-01T00:00:00  19160.0
6  CP_EUR_HAB  TOTAL  2001-01-01T00:00:00  16650.0
7  CP_EUR_HAB  TOTAL  2002-01-01T00:00:00  17570.0
8  CP_EUR_HAB  TOTAL  2003-01-01T00:00:00  18410.0
9  CP_EUR_HAB  TOTAL  2004-01-01T00:00:00  19950.0

  na_item        unit          TIME_PERIOD    value
0    B1GQ  CP_EUR_HAB  2013-01-01T00:00:00  38460.0
1    B1GQ  CP_EUR_HAB  2014-01-01T00:00:00  42350.0
2    B1GQ  CP_EUR_HAB  2015-01-01T00:00:00  49180.0
3    B1GQ  CP_EUR_HAB  2016-01-01T00:00:00  57900.0
4    B1GQ  CP_EUR_HAB  2017-01-01T00:00:00  65850.0
5    B1GQ  CP_EUR_HAB  2018-01-01T00:00:00  65330.0
6    B1GQ  CP_EUR_HAB  2019-01-01T00:00:00  63430.0
7    B1GQ  CP_EUR_HAB  2020-01-01T00:00:00  54190.0
8    B1GQ  CP_EUR_HAB  2021-01-01T00:00:00  61360.0
9    B1GQ  CP_EUR_HAB  2022-01-01T00:00:00  74950.0

  unit          coicop          TIME_PERIOD  value
0  I15   TOT_X_ALC_TBC  1996-01-01T00:00:00    NaN
1  I15  TOT_X_NRG_FOOD  1996-01-01T00:00:00    NaN
2  I15   TOT_X_ALC_TBC  1996-02-01T00:00:00    NaN
3  I15  TOT_X_NRG_FOOD  1996-02-01T00:00:00    NaN
4  I15   TOT_X_ALC_TBC  1996-03-01T00:00:00    NaN
5  I15  TOT_X_NRG_FOOD  1996-03-01T00:00:00    NaN
6  I15   TOT_X_ALC_TBC  1996-04-01T00:00:00    NaN
7  I15  TOT_X_NRG_FOOD  1996-04-01T00:00:00    NaN
8  I15   TOT_X_ALC_TBC  1996-05-01T00:00:00    NaN
9  I15  TOT_X_NRG_FOOD  1996-05-01T00:00:00    NaN

    unit          coicop          TIME_PERIOD  value
0  RCH_A  TOT_X_NRG_FOOD  1997-01-01T00:00:00    NaN
1  RCH_A       TOT_X_TBC  1997-01-01T00:00:00    NaN
2  RCH_A  TOT_X_NRG_FOOD  1997-02-01T00:00:00    NaN
3  RCH_A       TOT_X_TBC  1997-02-01T00:00:00    NaN
4  RCH_A  TOT_X_NRG_FOOD  1997-03-01T00:00:00    NaN
5  RCH_A       TOT_X_TBC  1997-03-01T00:00:00    NaN
6  RCH_A  TOT_X_NRG_FOOD  1997-04-01T00:00:00    NaN
7  RCH_A       TOT_X_TBC  1997-04-01T00:00:00    NaN
8  RCH_A  TOT_X_NRG_FOOD  1997-05-01T00:00:00    NaN
9  RCH_A       TOT_X_TBC  1997-05-01T00:00:00    NaN

   unit          coicop          TIME_PERIOD   value
0  rate  TOT_X_NRG_FOOD  1996-01-01T00:00:00     NaN
1  rate       TOT_X_TBC  1996-01-01T00:00:00     NaN
2  rate  TOT_X_NRG_FOOD  1997-01-01T00:00:00     NaN
3  rate       TOT_X_TBC  1997-01-01T00:00:00     NaN
4  rate  TOT_X_NRG_FOOD  1998-01-01T00:00:00     NaN
5  rate       TOT_X_TBC  1998-01-01T00:00:00     NaN
6  rate  TOT_X_NRG_FOOD  1999-01-01T00:00:00     NaN
7  rate       TOT_X_TBC  1999-01-01T00:00:00     NaN
8  rate  TOT_X_NRG_FOOD  2000-01-01T00:00:00  681.40
9  rate       TOT_X_TBC  2000-01-01T00:00:00  980.97

  unit sex     age isced11          TIME_PERIOD  value
0   PC   T  Y25-64   ED0-2  1995-01-01T00:00:00    NaN
1   PC   T  Y25-64   ED3_4  1995-01-01T00:00:00    NaN
2   PC   T  Y25-64   ED5-8  1995-01-01T00:00:00    NaN
3   PC   T  Y25-64   ED0-2  1996-01-01T00:00:00    NaN
4   PC   T  Y25-64   ED3_4  1996-01-01T00:00:00    NaN
5   PC   T  Y25-64   ED5-8  1996-01-01T00:00:00    NaN
6   PC   T  Y25-64   ED0-2  1997-01-01T00:00:00    NaN
7   PC   T  Y25-64   ED3_4  1997-01-01T00:00:00    NaN
8   PC   T  Y25-64   ED5-8  1997-01-01T00:00:00    NaN
9   PC   T  Y25-64   ED0-2  1998-01-01T00:00:00    NaN

      unit sex     age isced11          TIME_PERIOD  value
0  THS_PER   T  Y25-64   ED0-2  1995-01-01T00:00:00    NaN
1  THS_PER   T  Y25-64   ED3_4  1995-01-01T00:00:00    NaN
2  THS_PER   T  Y25-64   ED5-8  1995-01-01T00:00:00    NaN
3  THS_PER   T  Y25-64   TOTAL  1995-01-01T00:00:00  110.9
4  THS_PER   T  Y25-64   ED0-2  1996-01-01T00:00:00    NaN
5  THS_PER   T  Y25-64   ED3_4  1996-01-01T00:00:00    NaN
6  THS_PER   T  Y25-64   ED5-8  1996-01-01T00:00:00    NaN
7  THS_PER   T  Y25-64   TOTAL  1996-01-01T00:00:00  112.1
8  THS_PER   T  Y25-64   ED0-2  1997-01-01T00:00:00    NaN
9  THS_PER   T  Y25-64   ED3_4  1997-01-01T00:00:00    NaN

      age sex isco08  isced11     unit          TIME_PERIOD  value
0  Y20-64   F    NRP    ED0-2  THS_PER  1995-01-01T00:00:00    NaN
1  Y20-64   F    NRP  ED34_44  THS_PER  1995-01-01T00:00:00    NaN
2  Y20-64   F    NRP  ED35_45  THS_PER  1995-01-01T00:00:00    NaN
3  Y20-64   F    NRP    ED3_4  THS_PER  1995-01-01T00:00:00    NaN
4  Y20-64   F    NRP    ED5-8  THS_PER  1995-01-01T00:00:00    NaN
5  Y20-64   F    NRP      NRP  THS_PER  1995-01-01T00:00:00    NaN
6  Y20-64   F    NRP    TOTAL  THS_PER  1995-01-01T00:00:00    NaN
7  Y20-64   F    OC1    ED0-2  THS_PER  1995-01-01T00:00:00    NaN
8  Y20-64   F    OC1  ED34_44  THS_PER  1995-01-01T00:00:00    NaN
9  Y20-64   F    OC1  ED35_45  THS_PER  1995-01-01T00:00:00    NaN

      unit sex     age citizen          TIME_PERIOD  value
0  THS_PER   T  Y25-64   TOTAL  1995-01-01T00:00:00  110.9
1  THS_PER   T  Y25-64   TOTAL  1996-01-01T00:00:00  112.1
2  THS_PER   T  Y25-64   TOTAL  1997-01-01T00:00:00  111.0
3  THS_PER   T  Y25-64   TOTAL  1998-01-01T00:00:00  113.6
4  THS_PER   T  Y25-64   TOTAL  1999-01-01T00:00:00  119.0
5  THS_PER   T  Y25-64   TOTAL  2000-01-01T00:00:00  122.8
6  THS_PER   T  Y25-64   TOTAL  2001-01-01T00:00:00  124.0
7  THS_PER   T  Y25-64   TOTAL  2002-01-01T00:00:00  125.8
8  THS_PER   T  Y25-64   TOTAL  2003-01-01T00:00:00  125.6
9  THS_PER   T  Y25-64   TOTAL  2004-01-01T00:00:00  125.5

  indic_em s_adj sex     age     unit          TIME_PERIOD  value
0      ACT   NSA   F  Y15-24   PC_POP  2009-01-01T00:00:00   68.1
1      ACT   NSA   F  Y15-24  THS_PER  2009-01-01T00:00:00   13.0
2      ACT   NSA   F  Y15-29   PC_POP  2009-01-01T00:00:00   70.4
3      ACT   NSA   F  Y15-29  THS_PER  2009-01-01T00:00:00   22.0
4      ACT   NSA   F  Y15-64   PC_POP  2009-01-01T00:00:00   79.5
5      ACT   NSA   F  Y15-64  THS_PER  2009-01-01T00:00:00   79.0
6      ACT   NSA   F  Y15-74   PC_POP  2009-01-01T00:00:00   74.7
7      ACT   NSA   F  Y15-74  THS_PER  2009-01-01T00:00:00   82.0
8      ACT   NSA   F  Y20-64   PC_POP  2009-01-01T00:00:00   81.4
9      ACT   NSA   F  Y20-64  THS_PER  2009-01-01T00:00:00   74.0

     unit s_adj indic_em sex          TIME_PERIOD  value
0  PC_EMP   NSA      E_E   F  2010-04-01T00:00:00   93.6
1  PC_EMP   NSA      E_E   M  2010-04-01T00:00:00   95.1
2  PC_EMP   NSA      E_E   T  2010-04-01T00:00:00   94.4
3  PC_EMP   NSA      E_I   F  2010-04-01T00:00:00    4.0
4  PC_EMP   NSA      E_I   M  2010-04-01T00:00:00    3.3
5  PC_EMP   NSA      E_I   T  2010-04-01T00:00:00    3.6
6  PC_EMP   NSA      E_U   F  2010-04-01T00:00:00    2.4
7  PC_EMP   NSA      E_U   M  2010-04-01T00:00:00    NaN
8  PC_EMP   NSA      E_U   T  2010-04-01T00:00:00    2.0
9  PC_EMP   NSA      I_E   F  2010-04-01T00:00:00    NaN

  unit sex     age         citizen          TIME_PERIOD  value
0   PC   F  Y15-19   EU27_2020_FOR  1998-04-01T00:00:00    NaN
1   PC   F  Y15-19             FOR  1998-04-01T00:00:00    NaN
2   PC   F  Y15-19             NAT  1998-04-01T00:00:00   61.8
3   PC   F  Y15-19  NEU27_2020_FOR  1998-04-01T00:00:00    NaN
4   PC   F  Y15-19             NRP  1998-04-01T00:00:00    NaN
5   PC   F  Y15-19           TOTAL  1998-04-01T00:00:00   61.4
6   PC   F  Y15-24   EU27_2020_FOR  1998-04-01T00:00:00    NaN
7   PC   F  Y15-24             FOR  1998-04-01T00:00:00    NaN
8   PC   F  Y15-24             NAT  1998-04-01T00:00:00   68.4
9   PC   F  Y15-24  NEU27_2020_FOR  1998-04-01T00:00:00    NaN

  s_adj    age    unit sex          TIME_PERIOD  value
0    SA  TOTAL  PC_ACT   T  2003-01-01T00:00:00    3.8
1    SA  TOTAL  PC_ACT   T  2003-02-01T00:00:00    3.7
2    SA  TOTAL  PC_ACT   T  2003-03-01T00:00:00    3.6
3    SA  TOTAL  PC_ACT   T  2003-04-01T00:00:00    3.6
4    SA  TOTAL  PC_ACT   T  2003-05-01T00:00:00    3.5
5    SA  TOTAL  PC_ACT   T  2003-06-01T00:00:00    3.5
6    SA  TOTAL  PC_ACT   T  2003-07-01T00:00:00    3.5
7    SA  TOTAL  PC_ACT   T  2003-08-01T00:00:00    3.4
8    SA  TOTAL  PC_ACT   T  2003-09-01T00:00:00    3.4
9    SA  TOTAL  PC_ACT   T  2003-10-01T00:00:00    3.4

  sex     age unit isced11          TIME_PERIOD  value
0   T  Y25-64   PC   ED0-2  1999-01-01T00:00:00   43.3
1   T  Y25-64   PC   ED3_4  1999-01-01T00:00:00   34.9
2   T  Y25-64   PC   ED5-8  1999-01-01T00:00:00   21.8
3   T  Y25-64   PC   ED0-2  2000-01-01T00:00:00   44.2
4   T  Y25-64   PC   ED3_4  2000-01-01T00:00:00   32.0
5   T  Y25-64   PC   ED5-8  2000-01-01T00:00:00   23.8
6   T  Y25-64   PC   ED0-2  2001-01-01T00:00:00   43.7
7   T  Y25-64   PC   ED3_4  2001-01-01T00:00:00   32.6
8   T  Y25-64   PC   ED5-8  2001-01-01T00:00:00   23.8
9   T  Y25-64   PC   ED0-2  2002-01-01T00:00:00   41.3

  unit estruct         ecase          TIME_PERIOD     value
0  EUR     NET  P1_NCH_AW100  2000-01-01T00:00:00  27860.32
1  EUR     NET  P1_NCH_AW100  2001-01-01T00:00:00  25313.39
2  EUR     NET  P1_NCH_AW100  2002-01-01T00:00:00  26541.59
3  EUR     NET  P1_NCH_AW100  2003-01-01T00:00:00  28076.81
4  EUR     NET  P1_NCH_AW100  2004-01-01T00:00:00  29732.44
5  EUR     NET  P1_NCH_AW100  2005-01-01T00:00:00  38019.05
6  EUR     NET  P1_NCH_AW100  2006-01-01T00:00:00  37806.34
7  EUR     NET  P1_NCH_AW100  2007-01-01T00:00:00  42383.61
8  EUR     NET  P1_NCH_AW100  2008-01-01T00:00:00  27556.77
9  EUR     NET  P1_NCH_AW100  2009-01-01T00:00:00  21683.70

  unit nace_r2          TIME_PERIOD  value
0   PC     B-S  2007-01-01T00:00:00   23.4
1   PC     B-S  2008-01-01T00:00:00   20.5
2   PC     B-S  2009-01-01T00:00:00   18.0
3   PC     B-S  2010-01-01T00:00:00   17.5
4   PC     B-S  2011-01-01T00:00:00   17.5
5   PC     B-S  2012-01-01T00:00:00   17.2
6   PC     B-S  2013-01-01T00:00:00   18.5
7   PC     B-S  2014-01-01T00:00:00   16.4
8   PC     B-S  2015-01-01T00:00:00   17.0
9   PC     B-S  2016-01-01T00:00:00   15.6

In [6]:
for frame in DATAFRAMES:
    df = frame.dataframe.drop(columns=["TIME_PERIOD", "value"]).drop_duplicates()

    # if there is 'coicop' column, remove the values starting with CP
    if "coicop" in df.columns:
        df = df[~df["coicop"].astype(str).str.startswith("CP")]

    unique_values = {col: df[col].unique().tolist() for col in df.columns}
    print(f"Unique values for {frame.name}:")
    for col, values in unique_values.items():
        print(f"  {col}: {values}")
    print("\n")

Unique values for Quarterly GDP:
  unit: ['CLV_PCH_PRE', 'CLV_PCH_SM']
  s_adj: ['SCA', 'NSA']
  na_item: ['B1GQ']


Unique values for Annual Household Disposable Income:
  unit: ['CP_EUR_HAB']
  coicop: ['TOTAL']


Unique values for Annual GDP at Market Prices:
  na_item: ['B1GQ']
  unit: ['CP_EUR_HAB']


Unique values for Monthly Harmonized CPI:
  unit: ['I15']
  coicop: ['TOT_X_ALC_TBC', 'TOT_X_NRG_FOOD']


Unique values for Monthly CPI Inflation Rate:
  unit: ['RCH_A']
  coicop: ['TOT_X_NRG_FOOD', 'TOT_X_TBC']


Unique values for Annual CPI Inflation Rate by Income Group:
  unit: ['rate']
  coicop: ['TOT_X_NRG_FOOD', 'TOT_X_TBC']


Unique values for Annual Unemployment Rate by Education Level:
  unit: ['PC']
  sex: ['T']
  age: ['Y25-64']
  isced11: ['ED0-2', 'ED3_4', 'ED5-8']


Unique values for Annual Employment Rate by Education Level:
  unit: ['THS_PER']
  sex: ['T']
  age: ['Y25-64']
  isced11: ['ED0-2', 'ED3_4', 'ED5-8', 'TOTAL']


Unique values for Annual Employed Persons by Occupation and Educational Attainment Level:
  age: ['Y20-64', 'Y_GE15']
  sex: ['F', 'M', 'T']
  isco08: ['NRP', 'OC1', 'OC2', 'OC3', 'OC4', 'OC5', 'OC6', 'OC7', 'OC8', 'OC9', 'TOTAL']
  isced11: ['ED0-2', 'ED34_44', 'ED35_45', 'ED3_4', 'ED5-8', 'NRP', 'TOTAL']
  unit: ['THS_PER']


Unique values for Annual Employment:
  unit: ['THS_PER']
  sex: ['T']
  age: ['Y25-64']
  citizen: ['TOTAL']


Unique values for Quarterly employment and activity by sex and age:
  indic_em: ['ACT', 'EMP_LFS']
  s_adj: ['NSA', 'SA', 'TC']
  sex: ['F', 'M', 'T']
  age: ['Y15-24', 'Y15-29', 'Y15-64', 'Y15-74', 'Y20-64', 'Y25-54', 'Y55-64']
  unit: ['PC_POP', 'THS_PER']


Unique values for Quarterly labour market transitions:
  unit: ['PC_EMP', 'PC_INAC', 'PC_UNE', 'THS_PER']
  s_adj: ['NSA', 'SA']
  indic_em: ['E_E', 'E_I', 'E_U', 'I_E', 'I_I', 'I_U', 'U_E', 'U_I', 'U_U']
  sex: ['F', 'M', 'T']


Unique values for Quarterly employment rates by citizenship:
  unit: ['PC']
  sex: ['F', 'M', 'T']
  age: ['Y15-19', 'Y15-24', 'Y15-39', 'Y15-59', 'Y15-64', 'Y15-74', 'Y20-24', 'Y20-64', 'Y25-29', 'Y25-49', 'Y25-54', 'Y25-59', 'Y25-64', 'Y25-74', 'Y30-34', 'Y35-39', 'Y40-44', 'Y40-59', 'Y40-64', 'Y45-49', 'Y50-54', 'Y50-59', 'Y50-64', 'Y50-74', 'Y55-59', 'Y55-64', 'Y60-64', 'Y65-69', 'Y65-74', 'Y70-74', 'Y_GE15', 'Y_GE25', 'Y_GE50', 'Y_GE65', 'Y_GE75']
  citizen: ['EU27_2020_FOR', 'FOR', 'NAT', 'NEU27_2020_FOR', 'NRP', 'TOTAL', 'STLS']


Unique values for Monthly total unemployment rate:
  s_adj: ['SA']
  age: ['TOTAL']
  unit: ['PC_ACT']
  sex: ['T']


Unique values for Annual population by educational attainment level:
  sex: ['T']
  age: ['Y25-64']
  unit: ['PC']
  isced11: ['ED0-2', 'ED3_4', 'ED5-8']


Unique values for Annual net earnings:
  unit: ['EUR']
  estruct: ['NET']
  ecase: ['P1_NCH_AW100']


Unique values for Annual gender pay gap in unadjusted form:
  unit: ['PC']
  nace_r2: ['B-S']

In [7]:
for frame in DATAFRAMES:
    # get all the unique column combinations except TIME_PERIOD and value
    unique_combinations = frame.dataframe.drop(columns=["TIME_PERIOD", "value"]).drop_duplicates()

    if "coicop" in unique_combinations.columns:
        unique_combinations = unique_combinations[~unique_combinations["coicop"].astype(str).str.startswith("CP")]

    # get the number of values for each combination
    unique_combinations["value_count"] = unique_combinations.apply(
        lambda row: frame.dataframe[
            (frame.dataframe.drop(columns=["TIME_PERIOD", "value"]) == row).all(axis=1)
        ].shape[0], axis=1
    )

    print(f"Unique column combinations for {frame.name}:")
    display(unique_combinations)

Unique column combinations for Quarterly GDP:

          unit s_adj na_item  value_count
0  CLV_PCH_PRE   SCA    B1GQ          122
1   CLV_PCH_SM   NSA    B1GQ          122
2   CLV_PCH_SM   SCA    B1GQ          122

Unique column combinations for Annual Household Disposable Income:

         unit coicop  value_count
0  CP_EUR_HAB  TOTAL           30

Unique column combinations for Annual GDP at Market Prices:

  na_item        unit  value_count
0    B1GQ  CP_EUR_HAB           12

Unique column combinations for Monthly Harmonized CPI:

  unit          coicop  value_count
0  I15   TOT_X_ALC_TBC          357
1  I15  TOT_X_NRG_FOOD          357

Unique column combinations for Monthly CPI Inflation Rate:

    unit          coicop  value_count
0  RCH_A  TOT_X_NRG_FOOD          345
1  RCH_A       TOT_X_TBC          345

Unique column combinations for Annual CPI Inflation Rate by Income Group:

   unit          coicop  value_count
0  rate  TOT_X_NRG_FOOD           30
1  rate       TOT_X_TBC           30

Unique column combinations for Annual Unemployment Rate by Education Level:

  unit sex     age isced11  value_count
0   PC   T  Y25-64   ED0-2           30
1   PC   T  Y25-64   ED3_4           30
2   PC   T  Y25-64   ED5-8           30

Unique column combinations for Annual Employment Rate by Education Level:

      unit sex     age isced11  value_count
0  THS_PER   T  Y25-64   ED0-2           30
1  THS_PER   T  Y25-64   ED3_4           30
2  THS_PER   T  Y25-64   ED5-8           30
3  THS_PER   T  Y25-64   TOTAL           30

Unique column combinations for Annual Employed Persons by Occupation and Educational Attainment Level:

        age sex isco08  isced11     unit  value_count
0    Y20-64   F    NRP    ED0-2  THS_PER           30
1    Y20-64   F    NRP  ED34_44  THS_PER           30
2    Y20-64   F    NRP  ED35_45  THS_PER           30
3    Y20-64   F    NRP    ED3_4  THS_PER           30
4    Y20-64   F    NRP    ED5-8  THS_PER           30
..      ...  ..    ...      ...      ...          ...
391  Y_GE15   T  TOTAL    ED0-2  THS_PER           30
392  Y_GE15   T  TOTAL    ED3_4  THS_PER           30
393  Y_GE15   T  TOTAL    ED5-8  THS_PER           30
394  Y_GE15   T  TOTAL      NRP  THS_PER           30
395  Y_GE15   T  TOTAL    TOTAL  THS_PER           30

[396 rows x 6 columns]

Unique column combinations for Annual Employment:

      unit sex     age citizen  value_count
0  THS_PER   T  Y25-64   TOTAL           30

Unique column combinations for Quarterly employment and activity by sex and age:

    indic_em s_adj sex     age     unit  value_count
0        ACT   NSA   F  Y15-24   PC_POP           66
1        ACT   NSA   F  Y15-24  THS_PER           66
2        ACT   NSA   F  Y15-29   PC_POP           66
3        ACT   NSA   F  Y15-29  THS_PER           66
4        ACT   NSA   F  Y15-64   PC_POP           66
..       ...   ...  ..     ...      ...          ...
247  EMP_LFS    TC   T  Y20-64  THS_PER           66
248  EMP_LFS    TC   T  Y25-54   PC_POP           66
249  EMP_LFS    TC   T  Y25-54  THS_PER           66
250  EMP_LFS    TC   T  Y55-64   PC_POP           66
251  EMP_LFS    TC   T  Y55-64  THS_PER           66

[252 rows x 6 columns]

Unique column combinations for Quarterly labour market transitions:

        unit s_adj indic_em sex  value_count
0     PC_EMP   NSA      E_E   F           60
1     PC_EMP   NSA      E_E   M           60
2     PC_EMP   NSA      E_E   T           60
3     PC_EMP   NSA      E_I   F           60
4     PC_EMP   NSA      E_I   M           60
..       ...   ...      ...  ..          ...
211  THS_PER    SA      U_I   M           60
212  THS_PER    SA      U_I   T           60
213  THS_PER    SA      U_U   F           60
214  THS_PER    SA      U_U   M           60
215  THS_PER    SA      U_U   T           60

[216 rows x 5 columns]

Unique column combinations for Quarterly employment rates by citizenship:

    unit sex     age         citizen  value_count
0     PC   F  Y15-19   EU27_2020_FOR           95
1     PC   F  Y15-19             FOR           95
2     PC   F  Y15-19             NAT           95
3     PC   F  Y15-19  NEU27_2020_FOR           95
4     PC   F  Y15-19             NRP           95
..   ...  ..     ...             ...          ...
650   PC   T  Y_GE75             FOR           95
651   PC   T  Y_GE75             NAT           95
652   PC   T  Y_GE75  NEU27_2020_FOR           95
653   PC   T  Y_GE75             NRP           95
654   PC   T  Y_GE75           TOTAL           95

[655 rows x 5 columns]

Unique column combinations for Monthly total unemployment rate:

  s_adj    age    unit sex  value_count
0    SA  TOTAL  PC_ACT   T          273

Unique column combinations for Annual population by educational attainment level:

  sex     age unit isced11  value_count
0   T  Y25-64   PC   ED0-2           26
1   T  Y25-64   PC   ED3_4           26
2   T  Y25-64   PC   ED5-8           26

Unique column combinations for Annual net earnings:

  unit estruct         ecase  value_count
0  EUR     NET  P1_NCH_AW100           25

Unique column combinations for Annual gender pay gap in unadjusted form:

  unit nace_r2  value_count
0   PC     B-S           17

In [8]:
for frame in DATAFRAMES:
    quantiles_25 = []
    quantiles_75 = []
    interquartile_ranges = []

    for unit in df["unit"].unique():
        unit_data = df[df["unit"] == unit]
        quantiles_25.append(unit_data["value"].quantile(0.25))
        quantiles_75.append(unit_data["value"].quantile(0.75))
        interquartile_ranges.append(quantiles_75[-1] - quantiles_25[-1])

    # quantile_25 = frame.dataframe["value"].quantile(0.25)
    # quantile_75 = frame.dataframe["value"].quantile(0.75)
    # interquartile_range = quantile_75 - quantile_25
    # outliers = frame.dataframe[(frame.dataframe["value"] < (quantile_25 - 1.5 * interquartile_range)) | (frame.dataframe["value"] > (quantile_75 + 1.5 * interquartile_range))]

    # display(outliers.head(10))

    # plt.figure(figsize=(10, 6))
    # sns.boxplot(x=frame.dataframe["value"])
    # plt.title(f"{frame.name} - Outlier Detection")
    # plt.show()

KeyError: 'value'